#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 17/12/3 下午10:36
# @Author  : Aries
# @Site    : 
# @File    : py082_web_url.py
# @Software: PyCharm
'''
9–11. Web 站点地址.
a) 编写一个 URL 书签管理程序. 使用基于文本的菜单, 用户可以添加, 修改或者删除书签数据项.
书签数据项中包含站点的名称, URL 地址, 以及一行简单说明(可选).另外提供检索功能,可以根据检索关键字在站点名称和 URL 两部分查找可能的匹配.
程序退出时把数据保存到一个磁盘文件中去; 再次执行时候加载保存的数据.
b)改进 a) 的解决方案, 把书签输出到一个合法且语法正确的 HTML 文件(.html 或 htm )中,这样用户就可以使用浏览器查看自己的书签清单.
另外提供创建"文件夹"功能, 对相关的书签进行分组管理.
附加题: 请阅读 Python 的 re 模块了解有关正则表达式的资料, 使用正则表达式对用户输入的 URL 进行验证.
'''
pass
